# Usage: "brew bundle"
#
# 1. Install XCode command line utilities:
#     xcode-select --install
# 2. Install Homebrew (from the site):
#     open https://brew.sh
# 3. Install packagees
#     brew bundle
#
# This list is alphabetically sorted.

brew "aws-sam-cli"
brew "aws-shell"
brew "awscli"
brew "black"
brew "checkbashisms"
brew "clojure"
brew "cowsay"
brew "dos2unix"
brew "elm"
brew "fortune"
brew "gh"
brew "ghc"
brew "git"
brew "gpg"
brew "gti"
brew "htop"
brew "iperf3"
brew "jq"
brew "jsonpp"
brew "leiningen"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "postgresql@15"
brew "gnu-prolog"
brew "python-tk@3.12"
brew "python@3.12"
brew "readline"
brew "rlwrap"
brew "sbcl"
brew "sl"
brew "sqlite"
brew "tiger-vnc"
brew "wget"
brew "xonsh"

cask "miniconda"
cask "warp"
