# Usage: brew bundle --file=Brewfile.dev
# Optional developer stacks: languages, databases, CLIs.

tap "heroku/brew"
tap "mongodb/brew"

# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Python code formatter
brew "black"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# GNU CLISP, a Common Lisp implementation
brew "clisp"
# Statistics utility to count lines of code
brew "cloc"
# Dynamic, general-purpose programming language
brew "clojure"
# Functional programming language for building browser-based GUIs
brew "elm"
# GitHub command-line tool
brew "gh"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Prolog compiler with constraint solving
brew "gnu-prolog"
# Command-line JSON pretty-printer
brew "jsonpp"
# Build tool for Clojure
brew "leiningen"
# Web and API based SMTP testing
brew "mailpit", restart_service: :changed
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Framework for layout and rendering of i18n text
brew "pango"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Steel Bank Common Lisp system
brew "sbcl"
# Command-line utility to interact with Sentry
brew "sentry-cli"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Python-powered, cross-platform, Unix-gazing shell language and command prompt
brew "xonsh"
# Linter for YAML files
brew "yamllint"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"

# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Minimal installer for conda
cask "miniconda"
