# Usage: "brew bundle"
#
# 1. Install XCode command line utilities:
#     xcode-select --install
# 2. Install Homebrew (from the site):
#     open https://brew.sh
# 3. Install packagees
#     brew bundle
#
# The lists are alphabetically sorted.

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"

# OpenAI's coding agent that runs in your terminal
cask "codex"
# Minimal installer for conda
cask "miniconda"
# Rust-based terminal
cask "warp"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Universal database tool and SQL client
cask "dbeaver-community"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Python code formatter
brew "black"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# Dynamic, general-purpose programming language
brew "clojure"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Functional programming language for building browser-based GUIs
brew "elm"
# Infamous electronic fortune-cookie generator
brew "fortune"
# GitHub command-line tool
brew "gh"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Distributed revision control system
brew "git"
# Core application library for C
brew "glib"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Prolog compiler with constraint solving
brew "gnu-prolog"
# ASCII-art displaying typo-corrector for commands
brew "gti"
# OpenType text shaping engine
brew "harfbuzz"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Improved top (interactive process viewer)
brew "htop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line JSON pretty-printer
brew "jsonpp"
# Build tool for Clojure
brew "leiningen"
# Web and API based SMTP testing tool
brew "mailhog", restart_service: :changed
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Framework for layout and rendering of i18n text
brew "pango"
# Object-relational database system
brew "postgresql@17"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Library for command-line editing
brew "readline"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Steel Bank Common Lisp system
brew "sbcl"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Internet file retriever
brew "wget"
# Python-powered, cross-platform, Unix-gazing shell language and command prompt
brew "xonsh"
