# Usage: "brew bundle"
#
# 1. Install XCode command line utilities:
#     xcode-select --install
# 2. Install Homebrew (from the site):
#     open https://brew.sh
# 3. Install packagees
#     brew bundle
#
# The lists are alphabetically sorted.

tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"

# Minimal installer for conda
cask "miniconda"
# Rust-based terminal
cask "warp"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Python code formatter
brew "black"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# Dynamic, general-purpose programming language
brew "clojure"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Functional programming language for building browser-based GUIs
brew "elm"
# Infamous electronic fortune-cookie generator
brew "fortune"
# GitHub command-line tool
brew "gh"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Distributed revision control system
brew "git"
# Core application library for C
brew "glib"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Prolog compiler with constraint solving
brew "gnu-prolog"
# ASCII-art displaying typo-corrector for commands
brew "gti"
# OpenType text shaping engine
brew "harfbuzz"
# Improved top (interactive process viewer)
brew "htop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line JSON pretty-printer
brew "jsonpp"
# Build tool for Clojure
brew "leiningen"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Object-relational database system
brew "postgresql@15"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Library for command-line editing
brew "readline"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Steel Bank Common Lisp system
brew "sbcl"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Internet file retriever
brew "wget"
# Python-powered, cross-platform, Unix-gazing shell language and command prompt
brew "xonsh"

# VS Code extensions
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "astro-build.astro-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "hbenl.vscode-test-explorer"
vscode "mongodb.mongodb-vscode"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.test-adapter-converter"
vscode "orta.vscode-jest"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
